In [1]:
import numpy as np
import pandas as pd

In [8]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                      index = ['ohio','Colorado','Utan','New York'],
                      columns = ['one','two','three','four'])
data_df

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
Utan        8    9     10    11
New York   12   13     14    15

In [13]:
print(data_df,"\n")
#in the loc method specify row label
#then specify column names
#remember multiple column names required array notation
print(data_df.loc['Colorado',['two','three']])

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
Utan        8    9     10    11
New York   12   13     14    15

two      5
three    6
Name: Colorado, dtype: int64

In [16]:
print(data_df.loc[['Colorado','ohio'],['two','three']])

          two  three
Colorado    5      6
ohio        1      2

In [17]:
print(data_df.iloc[2,[3,0,1]])

four    11
one      8
two      9
Name: Utan, dtype: int64

In [18]:
print(data_df.iloc[:])

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
Utan        8    9     10    11
New York   12   13     14    15

print(data_df.iloc[:,:3])

In [25]:
print(data_df.iloc[:,:3])

          one  two  three
ohio        0    1      2
Colorado    4    5      6
Utan        8    9     10
New York   12   13     14

In [26]:
print(data_df.iloc[:3,:3])

          one  two  three
ohio        0    1      2
Colorado    4    5      6
Utan        8    9     10

In [23]:
print(data_df.iloc[:2])

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7

In [27]:
print(data_df.iloc[:,:3])

          one  two  three
ohio        0    1      2
Colorado    4    5      6
Utan        8    9     10
New York   12   13     14

In [24]:
[data_df.three>5]

[ohio        False
 Colorado     True
 Utan         True
 New York     True
 Name: three, dtype: bool]

## Arithmetic & Data Alignment

In [32]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                  columns = list('bcd'),
                  index = ['Ohio','Texas','Colorado'])
print(df1)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [29]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns = list('bde'),
                  index = ['Utah','Ohio','Texas','Oregon'])
print(df2)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [30]:
#applying plus operation between two data frames
df3 = df1 + df2
print(df3)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## Arithmetic methods with fill values

In [31]:
#your work is to fill all nan values of this df3 with a number 
#Choice of number is yours

In [55]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns = list('abcd'),
                  )
print(df1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [56]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns = list('abcde'),
                  )
print(df2)

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [57]:
df2.loc[1,'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [43]:
df3 = df1 + df2
print("direct + operation without fill_value")
print(df3)

direct + operation without fill_value
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [58]:
print("addition using a method with replacing Nan with 0")
print(df1)
print(df2)
df3 = df1.add(df2,fill_value=0)
print(df3)

addition using a method with replacing Nan with 0
     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [50]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns = list('abcd'),
                  )
print(df1)
df1.loc[1,'b'] = np.nan
print(df1)
df3 = df1.add(df1,fill_value=0)
print(df3)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  NaN   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d
0   0.0   2.0   4.0   6.0
1   8.0   NaN  12.0  14.0
2  16.0  18.0  20.0  22.0

In [60]:
0 + np.nan

nan